Revit 2027 API
PropertyTableEntry.Create Method
 Creates a new PropertyTableEntry object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PropertyTableEntry Create(
	double distance,
	double bearing,
	PropertyTableEntryCurveType curveType,
	double arcRadius,
	PropertyTableEntryArcDirection arcDir,
	int id
)
Public Shared Function Create (
	distance As Double,
	bearing As Double,
	curveType As PropertyTableEntryCurveType,
	arcRadius As Double,
	arcDir As PropertyTableEntryArcDirection,
	id As Integer
) As PropertyTableEntry
public:
static PropertyTableEntry^ Create(
	double distance,
	double bearing,
	PropertyTableEntryCurveType curveType,
	double arcRadius,
	PropertyTableEntryArcDirection arcDir,
	int id
)
static member Create :
        distance : float *
        bearing : float *
        curveType : PropertyTableEntryCurveType *
        arcRadius : float *
        arcDir : PropertyTableEntryArcDirection *
        id : int -> PropertyTableEntry
Parameters
distance Double
 The distance(start point to end point) of the PropertyTableEntry.
bearing Double
 The angle of the PropertyTableEntry. The value should be in [0-2*PI]
curveType PropertyTableEntryCurveType
 The type of curve represented by this entry.
arcRadius Double
 If the curveType is Arc, this input the radius of the arc; It is not used if type is Line.
arcDir PropertyTableEntryArcDirection
 If the curveType is Arc, indicate the curve direction, either left or right. It is not used if type is Line.
id Int32
 The id of the PropertyTableEntry.
Return Value
PropertyTableEntry
 The new PropertyTableEntry object.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  PropertyTableEntry is invalid - it refers to either distance is too short. Or for arc type, if the radius value is smaller than half the distance. It will also be considered as invalid. -or- Failed to create new PropertyTable object.
Remarks
 If the input data is not valid, for example the distance is too short, or the raduis is samller than half distance. an InvalidOperationException will be thrown.
See Also
Reference
PropertyTableEntry Class
Autodesk.Revit.DB Namespace